DataProcessors/ПанельНастроекУправлениеПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПанельНастроекУправлениеПерсоналом</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОхраныТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРабочиеМестаОхраныТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьИнструктажиПоОхранеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбучениеПоОхранеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНесчастныеСлучаиНаПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьМедицинскиеОсмотры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПсихиатрическиеОсвидетельствования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСпециальнуюОценкуУсловийТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСредстваИндивидуальнойЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьУникальностьНомеровРабочихМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособКонтроляУникальностиНомеровРабочихМест</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыКонтроляУникальностиНомеровРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьУсловияТрудаРабочихМестОхраныТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогАктуальностиВредныхФакторовВидовРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьСпециальнуюОценкуУсловийТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиНесчастныхСлучаевНаПроизводстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиНесчастныхСлучаевНаПроизводстве</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьНесчастныеСлучаиНаПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПанельНастроекУправлениеПерсоналом/Forms/ОхранаТруда/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		Модуль.ПриСозданииФормыСпискаОрганизаций(ЭтотОбъект, Параметры, Организации);
	КонецЕсли;
	
	РежимНастройкиОхраныТруда =
		?(Константы.ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций.Получить(), 1, 0);
	
	Если РежимНастройкиОхраныТруда = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьСпециальнуюОценкуУсловийТрудаПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьСпециальнуюОценкуУсловийТруда");
	
	ОбновитьНастройкиСпециальнойОценкиУсловийТруда(ЭтотОбъект);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНесчастныеСлучаиНаПроизводствеПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьНесчастныеСлучаиНаПроизводстве");
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИнструктажиПоОхранеТрудаПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьИнструктажиПоОхранеТруда");
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбучениеПоОхранеТрудаПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьОбучениеПоОхранеТруда");
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМедицинскиеОсмотрыПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьМедицинскиеОсмотры");
	
	ОбновитьНастройкиМедицинскихОсмотров(ЭтотОбъект);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПсихиатрическиеОсвидетельствованияПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьПсихиатрическиеОсвидетельствования");
	ЗначениеКонстантыИспользоватьПсихиатрическиеОсвидетельствования = ИспользоватьПсихиатрическиеОсвидетельствования;
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьУникальностьНомеровРабочихМестПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("КонтролироватьУникальностьНомеровРабочихМест");
	
	ЗначениеКонстантыКонтролироватьУникальностьНомеровРабочихМест = КонтролироватьУникальностьНомеровРабочихМест;
	ОбновитьНастройкиКонтроляУникальностиНомеровРабочихМест(ЭтотОбъект);
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособКонтроляУникальностиНомеровРабочихМестПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("СпособКонтроляУникальностиНомеровРабочихМест");
	ЗначениеКонстантыСпособКонтроляУникальностиНомеровРабочихМест = СпособКонтроляУникальностиНомеровРабочихМест;
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСредстваИндивидуальнойЗащитыПриИзменении(Элемент)
	НачатьИзменениеИспользованияСредствИндивидуальнойЗащиты();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРабочиеМестаОхраныТрудаПриИзменении(Элемент)
	НачатьИзменениеИспользованияРабочихМестОхраныТруда();
КонецПроцедуры

&НаКлиенте
Процедура ПрименятьУсловияТрудаРабочихМестОхраныТрудаПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ПрименятьУсловияТрудаРабочихМестОхраныТруда");
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизацийПриИзменении(Элемент)
	НачатьИзменениеИспользованияНастроекОхраныТрудаВРазрезеОрганизаций();
КонецПроцедуры

&НаКлиенте
Процедура ПорогАктуальностиВредныхФакторовВидовРаботПриИзменении(Элемент)

	УстановитьСклонениеЕдиницыИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот(ЭтотОбъект);
	ЗаписатьНастройкиНаКлиенте("ПорогАктуальностиВредныхФакторовВидовРабот");
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();

КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРаботПриИзменении(Элемент)

	ЗаписатьНастройкиНаКлиенте("ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот");
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОрганизации

&НаКлиенте
Процедура ОрганизацииПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьНастройкиОрганизацииНаКлиенте", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройки()
	
	Если РежимНастройкиОхраныТруда = 1 Тогда
		Настройки = РегистрыСведений.НастройкиОхраныТруда.СоздатьМенеджерЗаписи();
		Настройки.Организация = ТекущаяОрганизация;
		Настройки.Прочитать();
		ЗначениеВРеквизитФормы(Настройки, "НастройкиОхраныТруда");
		
		ИспользоватьРабочиеМестаОхраныТруда = Настройки.ИспользоватьРабочиеМестаОхраныТруда;
		
		ПрименятьУсловияТрудаРабочихМестОхраныТруда = Настройки.ПрименятьУсловияТрудаРабочихМестОхраныТруда;
		ИспользоватьИнструктажиПоОхранеТруда = Настройки.ИспользоватьИнструктажиПоОхранеТруда;
		ИспользоватьОбучениеПоОхранеТруда = Настройки.ИспользоватьОбучениеПоОхранеТруда;
		ИспользоватьСредстваИндивидуальнойЗащиты = Настройки.ИспользоватьСредстваИндивидуальнойЗащиты;
		
		ИспользоватьМедицинскиеОсмотры = Настройки.ИспользоватьМедицинскиеОсмотры;
		ПорогАктуальностиВредныхФакторовВидовРабот = Настройки.ПорогАктуальностиВредныхФакторовВидовРабот;
		ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот = Настройки.ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот;
		
		ЗначениеКонстантыИспользоватьПсихиатрическиеОсвидетельствования = Настройки.ИспользоватьПсихиатрическиеОсвидетельствования;
		ЗначениеКонстантыКонтролироватьУникальностьНомеровРабочихМест = Настройки.КонтролироватьУникальностьНомеровРабочихМест;
		ЗначениеКонстантыСпособКонтроляУникальностиНомеровРабочихМест = Настройки.СпособКонтроляУникальностиНомеровРабочихМест;
		
		ИспользоватьСпециальнуюОценкуУсловийТруда = Настройки.ИспользоватьСпециальнуюОценкуУсловийТруда;
		ИспользоватьНесчастныеСлучаиНаПроизводстве = Настройки.ИспользоватьНесчастныеСлучаиНаПроизводстве;
	Иначе
		ИспользоватьРабочиеМестаОхраныТруда = Константы.ИспользоватьРабочиеМестаОхраныТруда.Получить();
		
		Настройки = РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда.СоздатьМенеджерЗаписи();
		Настройки.Прочитать();
		ЗначениеВРеквизитФормы(Настройки, "НастройкиСпециальнойОценкиУсловийТруда");
		ИспользоватьСпециальнуюОценкуУсловийТруда = Настройки.ИспользоватьСпециальнуюОценкуУсловийТруда;
		
		Настройки = РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве.СоздатьМенеджерЗаписи();
		Настройки.Прочитать();
		ЗначениеВРеквизитФормы(Настройки, "НастройкиНесчастныхСлучаевНаПроизводстве");
		ИспользоватьНесчастныеСлучаиНаПроизводстве = Настройки.ИспользоватьНесчастныеСлучаиНаПроизводстве;
		
		ПрименятьУсловияТрудаРабочихМестОхраныТруда = Константы.ПрименятьУсловияТрудаРабочихМестОхраныТруда.Получить();
		ИспользоватьИнструктажиПоОхранеТруда = Константы.ИспользоватьИнструктажиПоОхранеТруда.Получить();
		ИспользоватьМедицинскиеОсмотры = Константы.ИспользоватьМедицинскиеОсмотры.Получить();
		ИспользоватьСредстваИндивидуальнойЗащиты = Константы.ИспользоватьСредстваИндивидуальнойЗащиты.Получить();
		
		ЗначениеКонстантыИспользоватьПсихиатрическиеОсвидетельствования = Константы.ИспользоватьПсихиатрическиеОсвидетельствования.Получить();
		ЗначениеКонстантыКонтролироватьУникальностьНомеровРабочихМест = Константы.КонтролироватьУникальностьНомеровРабочихМест.Получить();
		ЗначениеКонстантыСпособКонтроляУникальностиНомеровРабочихМест = Константы.СпособКонтроляУникальностиНомеровРабочихМест.Получить();
		
		Настройки = ОхранаТруда.СведенияОНастройкахОхраныТруда();
		ПорогАктуальностиВредныхФакторовВидовРабот = Настройки.ПорогАктуальностиВредныхФакторовВидовРабот;
		ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот = Настройки.ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот;
		ИспользоватьОбучениеПоОхранеТруда = Настройки.ИспользоватьОбучениеПоОхранеТруда;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиОрганизацииНаКлиенте()
	
	Если ЗначениеЗаполнено(ТекущаяОрганизация) И ТекущаяОрганизация = Элементы.Организации.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяОрганизация = Элементы.Организации.ТекущаяСтрока;
	ПрочитатьНастройки();
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНастройкиМедицинскихОсмотров(Форма)
	
	Если Форма.ИспользоватьМедицинскиеОсмотры Тогда
		Форма.ИспользоватьПсихиатрическиеОсвидетельствования = Форма.ЗначениеКонстантыИспользоватьПсихиатрическиеОсвидетельствования;
	Иначе
		Форма.ИспользоватьПсихиатрическиеОсвидетельствования = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ИспользоватьПсихиатрическиеОсвидетельствования",
		"ТолькоПросмотр",
		Не Форма.ИспользоватьМедицинскиеОсмотры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПорогАктуальностиВредныхФакторовВидовРаботГруппа",
		"ТолькоПросмотр",
		Не Форма.ИспользоватьМедицинскиеОсмотры);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПояснениеИспользоватьМедицинскиеОсмотры",
		"Доступность",
		Форма.ИспользоватьМедицинскиеОсмотры);

	УстановитьСклонениеЕдиницыИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНастройкиСпециальнойОценкиУсловийТруда(Форма)
	
	Если Форма.ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		Форма.КонтролироватьУникальностьНомеровРабочихМест = Форма.ЗначениеКонстантыКонтролироватьУникальностьНомеровРабочихМест;
		Форма.СпособКонтроляУникальностиНомеровРабочихМест = Форма.ЗначениеКонстантыСпособКонтроляУникальностиНомеровРабочихМест;
	Иначе
		Форма.КонтролироватьУникальностьНомеровРабочихМест = Ложь;
		Форма.СпособКонтроляУникальностиНомеровРабочихМест = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КонтролироватьУникальностьНомеровРабочихМестГруппа",
		"Видимость",
		Форма.ИспользоватьСпециальнуюОценкуУсловийТруда);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СпособКонтроляУникальностиНомеровРабочихМест",
		"ТолькоПросмотр",
		Не Форма.КонтролироватьУникальностьНомеровРабочихМест);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНастройкиКонтроляУникальностиНомеровРабочихМест(Форма)
	
	Если Форма.КонтролироватьУникальностьНомеровРабочихМест Тогда
		Форма.СпособКонтроляУникальностиНомеровРабочихМест = Форма.ЗначениеКонстантыСпособКонтроляУникальностиНомеровРабочихМест;
	Иначе
		Форма.СпособКонтроляУникальностиНомеровРабочихМест = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СпособКонтроляУникальностиНомеровРабочихМест",
		"ТолькоПросмотр",
		Не Форма.КонтролироватьУникальностьНомеровРабочихМест);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНастройкиОхраныТрудаВРазрезеОрганизаций(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Организации",
		"Видимость",
		Форма.РежимНастройкиОхраныТруда = 1);
		
	Если Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьНесколькоОрганизацийЗарплатаКадрыРасширенная") Тогда
		ОтображениеПодсказкиГруппыЗаголовка = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе
		ОтображениеПодсказкиГруппыЗаголовка = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ГруппаЗаголовок",
		"ОтображениеПодсказки",
		ОтображениеПодсказкиГруппыЗаголовка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияОбновленияИнтерфейса() Экспорт
	
	ТребуетсяОбновлениеИнтерфейса = Истина;
	
	#Если НЕ ВебКлиент Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновленияИнтерфейса", 1, Истина);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбработчикОжиданияОбновленияИнтерфейса()
	
	ОбновитьИнтерфейс();
	
	ТребуетсяОбновлениеИнтерфейса = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиНаКлиенте(ИмяНастройки)
	
	ЗаписатьНастройкиНаСервере(ИмяНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере(ИмяНастройки)
	
	ПараметрыНастроек = Обработки.ПанельНастроекУправлениеПерсоналом.ЗаполнитьСтруктуруПараметровНастроек(ИмяНастройки);
	
	ПараметрыНастроек.ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций = РежимНастройкиОхраныТруда = 1;
	ПараметрыНастроек.ИспользоватьРабочиеМестаОхраныТруда = ИспользоватьРабочиеМестаОхраныТруда;
	ПараметрыНастроек.НастройкиОхраныТруда = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
		НастройкиОхраныТруда, Метаданные.РегистрыСведений.НастройкиОхраныТруда);
	ПараметрыНастроек.Организация = ТекущаяОрганизация;
	ПараметрыНастроек.ИспользоватьСпециальнуюОценкуУсловийТруда = ИспользоватьСпециальнуюОценкуУсловийТруда;
	ПараметрыНастроек.ИспользоватьНесчастныеСлучаиНаПроизводстве = ИспользоватьНесчастныеСлучаиНаПроизводстве;
	ПараметрыНастроек.ИспользоватьИнструктажиПоОхранеТруда = ИспользоватьИнструктажиПоОхранеТруда;
	ПараметрыНастроек.ИспользоватьОбучениеПоОхранеТруда = ИспользоватьОбучениеПоОхранеТруда;
	ПараметрыНастроек.ИспользоватьМедицинскиеОсмотры = ИспользоватьМедицинскиеОсмотры;
	ПараметрыНастроек.ИспользоватьПсихиатрическиеОсвидетельствования = ИспользоватьПсихиатрическиеОсвидетельствования;
	ПараметрыНастроек.ПорогАктуальностиВредныхФакторовВидовРабот = ПорогАктуальностиВредныхФакторовВидовРабот;
	ПараметрыНастроек.ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот = ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот;
	ПараметрыНастроек.ИспользоватьСредстваИндивидуальнойЗащиты = ИспользоватьСредстваИндивидуальнойЗащиты;
	ПараметрыНастроек.КонтролироватьУникальностьНомеровРабочихМест = КонтролироватьУникальностьНомеровРабочихМест;
	ПараметрыНастроек.СпособКонтроляУникальностиНомеровРабочихМест = СпособКонтроляУникальностиНомеровРабочихМест;
	ПараметрыНастроек.ПрименятьУсловияТрудаРабочихМестОхраныТруда = ПрименятьУсловияТрудаРабочихМестОхраныТруда;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Обработки.ПанельНастроекУправлениеПерсоналом.ЗаписатьНастройки(ПараметрыНастроек, АдресХранилища);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#Область СредстваИндивидуальнойЗащиты

&НаКлиенте
Процедура НачатьИзменениеИспользованияСредствИндивидуальнойЗащиты()
	
	Если Не ИспользоватьСредстваИндивидуальнойЗащиты Тогда
		ЗаписатьНастройкиНаКлиенте("ИспользоватьСредстваИндивидуальнойЗащиты");
		ОбновитьНастройкиСредствИндивидуальнойЗащиты(ЭтотОбъект);
		ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
		НачатьУстановкуИспользованияСредствИндивидуальнойЗащиты();
		Возврат;
	КонецЕсли;

	ТекстВопроса = 
		НСтр("ru = 'Использование средств индивидуальной защиты невозможно без использования дополнительных реквизитов и сведений.
			 | Использование дополнительных реквизитов и сведений так же будет включено.
			 |
			 |Продолжить?'");

	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Использование дополнительных реквизитов и сведений будет включено'");
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить(Истина, НСтр("ru = 'Продолжить'"));
	КнопкиОтвета.Добавить(Ложь, НСтр("ru = 'Отмена'"));
	
	ОбработчикОтвета = Новый ОписаниеОповещения("ЗавершитьИзменениеИспользованияСредствИндивидуальнойЗащиты", ЭтотОбъект);
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОбработчикОтвета, ТекстВопроса, КнопкиОтвета, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменениеИспользованияСредствИндивидуальнойЗащиты(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение <> Истина Тогда
		ИспользоватьСредстваИндивидуальнойЗащиты = Ложь;
		Возврат;
	КонецЕсли;
	
	НачатьУстановкуИспользованияСредствИндивидуальнойЗащиты();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуИспользованияСредствИндивидуальнойЗащиты()
	
	Элементы.ИспользоватьСредстваИндивидуальнойЗащиты.Доступность = Ложь;
	Элементы.ИспользованиеСредствИндивидуальнойЗащитыОжидание.Видимость = Истина;
	
	ДлительнаяОперация = ДлительнаяОперацииУстановкиИспользованияСредствИндивидуальнойЗащиты(ТекущаяОрганизация);
 
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Средства индивидуальной защиты'");
	ПараметрыОжидания.ОповещениеПользователя.Пояснение = НСтр("ru = 'Установлено'");
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;

	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация, 
		Новый ОписаниеОповещения("ЗавершитьУстановкуИспользованияСредствИндивидуальнойЗащиты", ЭтотОбъект), 
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУстановкуИспользованияСредствИндивидуальнойЗащиты(Результат, ДополнительныеПараметры) Экспорт

	Элементы.ИспользоватьСредстваИндивидуальнойЗащиты.Доступность = Истина;
	Элементы.ИспользованиеСредствИндивидуальнойЗащитыОжидание.Видимость = Ложь;

	Если Результат = Неопределено Тогда
		ИспользоватьСредстваИндивидуальнойЗащиты = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ИспользоватьСредстваИндивидуальнойЗащиты = Ложь;
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьСредстваИндивидуальнойЗащиты");
	ОбновитьНастройкиСредствИндивидуальнойЗащиты(ЭтотОбъект);
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацииУстановкиИспользованияСредствИндивидуальнойЗащиты(Организация)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"СредстваИндивидуальнойЗащиты.УстановитьИспользованиеСредствИндивидуальнойЗащиты", Организация);
		
КонецФункции

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНастройкиСредствИндивидуальнойЗащиты(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПояснениеИспользоватьСредстваИндивидуальнойЗащиты",
		"Доступность",
		Форма.ИспользоватьСредстваИндивидуальнойЗащиты);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормы(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПояснениеИспользоватьРабочиеМестаОхраныТруда",
		"Доступность",
		Форма.ИспользоватьРабочиеМестаОхраныТруда);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПрименятьУсловияТрудаРабочихМестОхраныТрудаГруппа",
		"Доступность",
		Форма.ИспользоватьРабочиеМестаОхраныТруда);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СпециальнаяОценкаГруппа",
		"Доступность",
		Форма.ИспользоватьРабочиеМестаОхраныТруда);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"НесчастныеСлучаиГруппа",
		"Доступность",
		Форма.ИспользоватьРабочиеМестаОхраныТруда);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ОбучениеПоОхранеТруда",
		"Доступность",
		Форма.ИспользоватьРабочиеМестаОхраныТруда);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МедицинскиеОсмотрыГруппа",
		"Доступность",
		Форма.ИспользоватьРабочиеМестаОхраныТруда);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СредстваИндивидуальнойЗащитыГруппа",
		"Доступность",
		Форма.ИспользоватьРабочиеМестаОхраныТруда);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"НастроитьУчетРабочихМестПоОрганизациям",
		"Доступность",
		Форма.ИспользоватьРабочиеМестаОхраныТруда);
	
	ОбновитьНастройкиМедицинскихОсмотров(Форма);
	ОбновитьНастройкиСредствИндивидуальнойЗащиты(Форма);
	ОбновитьНастройкиСпециальнойОценкиУсловийТруда(Форма);
	ОбновитьНастройкиОхраныТрудаВРазрезеОрганизаций(Форма);
	
КонецПроцедуры

#Область ИспользованиеИспользованиеРабочихМестОхраныТруда

&НаКлиенте
Процедура ИзмененитьИспользованиеРабочихМестОхраныТруда(ИмяНастройки = "ИспользоватьРабочиеМестаОхраныТруда")
	
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект);
	ЗаписатьНастройкиНаКлиенте(ИмяНастройки);
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИзменениеИспользованияРабочихМестОхраныТруда()

	Если ИспользоватьРабочиеМестаОхраныТруда Тогда
		ИзмененитьИспользованиеРабочихМестОхраныТруда();
		Возврат;
	КонецЕсли;
	
	Если Не (ПолучитьФункциональнуюОпциюФормы("ИспользоватьИнструктажиПоОхранеТруда")
		Или ПолучитьФункциональнуюОпциюФормы("ИспользоватьОбучениеПоОхранеТруда")
		Или ПолучитьФункциональнуюОпциюФормы("ИспользоватьМедицинскиеОсмотры")
		Или ПолучитьФункциональнуюОпциюФормы("ИспользоватьНесчастныеСлучаиНаПроизводстве")
		Или ПолучитьФункциональнуюОпциюФормы("ИспользоватьСпециальнуюОценкуУсловийТруда")
		Или ПолучитьФункциональнуюОпциюФормы("ИспользоватьСредстваИндивидуальнойЗащиты")
		Или ПолучитьФункциональнуюОпциюФормы("ПрименятьУсловияТрудаРабочихМестОхраныТруда")) Тогда
		
		ИзмененитьИспользованиеРабочихМестОхраныТруда();
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = 
		НСтр("ru = 'Использование подсистем охраны труда невозможно без использования рабочих мест. Включенные подсистемы охраны труда будут отключены.
			 |
			 |Продолжить?'");

	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Использование подсистем охраны труда будет отключено'");
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить(Истина, НСтр("ru = 'Продолжить'"));
	КнопкиОтвета.Добавить(Ложь, НСтр("ru = 'Отмена'"));
	
	ОбработчикОтвета = Новый ОписаниеОповещения("ЗавершитьИзменениеИспользованияРабочихМестОхраныТруда", ЭтотОбъект);
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОбработчикОтвета, ТекстВопроса, КнопкиОтвета, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменениеИспользованияРабочихМестОхраныТруда(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение <> Истина Тогда
		ИспользоватьРабочиеМестаОхраныТруда = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяНастройки = "ИспользоватьРабочиеМестаОхраныТруда";
	
	Если ПрименятьУсловияТрудаРабочихМестОхраныТруда Тогда
		ИмяНастройки = ИмяНастройки + ",ПрименятьУсловияТрудаРабочихМестОхраныТруда";
		ПрименятьУсловияТрудаРабочихМестОхраныТруда = Ложь;
	КонецЕсли;
	
	Если ИспользоватьМедицинскиеОсмотры Тогда
		ИмяНастройки = ИмяНастройки + ",ИспользоватьМедицинскиеОсмотры";
		ИспользоватьМедицинскиеОсмотры = Ложь;
	КонецЕсли;
	
	Если ИспользоватьИнструктажиПоОхранеТруда Тогда
		ИмяНастройки = ИмяНастройки + ",ИспользоватьИнструктажиПоОхранеТруда";
		ИспользоватьИнструктажиПоОхранеТруда = Ложь;
	КонецЕсли;
	
	Если ИспользоватьОбучениеПоОхранеТруда Тогда
		ИмяНастройки = ИмяНастройки + ",ИспользоватьОбучениеПоОхранеТруда";
		ИспользоватьОбучениеПоОхранеТруда = Ложь;
	КонецЕсли;
	
	Если ИспользоватьНесчастныеСлучаиНаПроизводстве Тогда
		ИмяНастройки = ИмяНастройки + ",ИспользоватьНесчастныеСлучаиНаПроизводстве";
		ИспользоватьНесчастныеСлучаиНаПроизводстве = Ложь;
	КонецЕсли;
	
	Если ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		ИмяНастройки = ИмяНастройки + ",ИспользоватьСпециальнуюОценкуУсловийТруда";
		ИспользоватьСпециальнуюОценкуУсловийТруда = Ложь;
	КонецЕсли;
	
	Если ИспользоватьСредстваИндивидуальнойЗащиты Тогда
		ИмяНастройки = ИмяНастройки + ",ИспользоватьСредстваИндивидуальнойЗащиты";
		ИспользоватьСредстваИндивидуальнойЗащиты = Ложь;
	КонецЕсли;
	
	ИзмененитьИспользованиеРабочихМестОхраныТруда(ИмяНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИзменениеИспользованияНастроекОхраныТрудаВРазрезеОрганизаций()

	Если РежимНастройкиОхраныТруда = 1 Тогда
		ИзмененитьИспользованиеНастроекОхраныТрудаВРазрезеОрганизаций();
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = 
		НСтр("ru = 'Переключение на настройки охраны труда для программы в целом. Всем организациям будут установлены текущие настройки.
			 |
			 |Продолжить?'");

	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Всем организациям будут установлены текущие настройки'");
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить(Истина, НСтр("ru = 'Продолжить'"));
	КнопкиОтвета.Добавить(Ложь, НСтр("ru = 'Отмена'"));
	
	ОбработчикОтвета = Новый ОписаниеОповещения("ЗавершитьИзменениеИспользованияНастроекОхраныТрудаВРазрезеОрганизаций", ЭтотОбъект);
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОбработчикОтвета, ТекстВопроса, КнопкиОтвета, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменениеИспользованияНастроекОхраныТрудаВРазрезеОрганизаций(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение <> Истина Тогда
		РежимНастройкиОхраныТруда = 1;
		Возврат;
	КонецЕсли;
	
	ИзмененитьИспользованиеНастроекОхраныТрудаВРазрезеОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененитьИспользованиеНастроекОхраныТрудаВРазрезеОрганизаций()
	
	ИмяНастройки =
		"ИспользоватьНастройкиОхраныТрудаВРазрезеОрганизаций,
		|ИспользоватьРабочиеМестаОхраныТруда,
		|ПрименятьУсловияТрудаРабочихМестОхраныТруда,
		|ИспользоватьМедицинскиеОсмотры,
		|ИспользоватьПсихиатрическиеОсвидетельствования,
		|ПорогАктуальностиВредныхФакторовВидовРабот,
		|ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот,
		|ИспользоватьИнструктажиПоОхранеТруда,
		|ИспользоватьОбучениеПоОхранеТруда,
		|ИспользоватьНесчастныеСлучаиНаПроизводстве,
		|ИспользоватьСпециальнуюОценкуУсловийТруда,
		|КонтролироватьУникальностьНомеровРабочихМест,
		|СпособКонтроляУникальностиНомеровРабочихМест,
		|ИспользоватьСредстваИндивидуальнойЗащиты";
	
	ИспользоватьПсихиатрическиеОсвидетельствования = ЗначениеКонстантыИспользоватьПсихиатрическиеОсвидетельствования;
	КонтролироватьУникальностьНомеровРабочихМест = ЗначениеКонстантыКонтролироватьУникальностьНомеровРабочихМест;
	СпособКонтроляУникальностиНомеровРабочихМест = ЗначениеКонстантыСпособКонтроляУникальностиНомеровРабочихМест;
	
	ЗаписатьНастройкиНаКлиенте(ИмяНастройки);
	ТекущаяОрганизация = Неопределено;
	ПодключитьОбработчикОжидания("УстановитьНастройкиОрганизацииНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСклонениеЕдиницыИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот(Форма)
	
	СклонениеДней = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';день;;дня;дней;'"),
		Форма.ПорогАктуальностиВредныхФакторовВидовРабот);
	Форма.Элементы.ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот.СписокВыбора.НайтиПоЗначению(
		ПредопределенноеЗначение("Перечисление.Периодичность.День")).Представление = СклонениеДней;
		
	СклонениеМесяцев = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';месяц;;месяца;месяцев;'"),
		Форма.ПорогАктуальностиВредныхФакторовВидовРабот);
	Форма.Элементы.ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот.СписокВыбора.НайтиПоЗначению(
		ПредопределенноеЗначение("Перечисление.Периодичность.Месяц")).Представление = СклонениеМесяцев;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
